Parlor.create!(
  [
    {
      name: '麻雀オクタゴン',
      address: '日本、〒150-0041 東京都渋谷区神南１丁目２０−１６ 髙山ランドビル 5階Ａ号室',
      latitude: 35.6621723,
      longitude: 139.7000845,
    },
    {
      name: 'しぶとん',
      address: '日本、〒150-0043 東京都渋谷区道玄坂２丁目１０−１２',
      latitude: 35.6586889,
      longitude: 139.6977984,
    },
    {
      name: '健康麻将 ガラパゴス 渋谷本店',
      address: '日本、〒150-0043 東京都渋谷区道玄坂２丁目６−１５ ユニ道玄坂ビル 4F',
      latitude: 35.659002,
      longitude: 139.69849,
    },
    {
      name: 'エンジョイマージャン エフ',
      address: '日本、〒150-0043 東京都渋谷区道玄坂１丁目２０−１２ ＭＴ道玄坂ビル',
      latitude: 35.656915,
      longitude: 139.6964621,
    },
    {
      name: '麻雀ZOO 渋谷文化村通り店',
      address: '日本、〒150-0043 東京都渋谷区道玄坂２丁目２９−１８ 清水ビル 4F',
      latitude: 35.6600256,
      longitude: 139.6978806,
    },
    {
      name: '麻雀クエスチョン 渋谷店',
      address: '日本、〒150-0043 東京都渋谷区道玄坂２丁目２９−１８ 才籐第二ビル 7階',
      latitude: 35.6600506,
      longitude: 139.6979692,
    },
    {
      name: '麻雀ZOO 渋谷バスケ通り店',
      address: '日本、〒150-0042 東京都渋谷区宇田川町２８−２ ドトールコーヒーショップ渋谷センター街店 3F',
      latitude: 35.6602912,
      longitude: 139.698315,
    },
    {
      name: 'フリー麻雀さん渋谷店',
      address: '日本、〒150-0042 東京都渋谷区宇田川町２４−４',
      latitude: 35.660138,
      longitude: 139.699651,
    },
    {
      name: '雀荘 すずめ荘',
      address: '日本、〒150-0043 東京都渋谷区道玄坂１丁目１１ 第１富士商事ビル ３Ｆ',
      latitude: 35.6576151,
      longitude: 139.6987291,
    },
    {
      name: '麻雀ウェルカム渋谷店',
      address: '日本、〒150-0041 東京都渋谷区神南１丁目２２−７',
      latitude: 35.6610962,
      longitude: 139.7010315,
    },
    {
      name: '麻雀クラブ源',
      address: '日本、〒150-0002 東京都渋谷区渋谷１丁目２４−７ 渋谷フラットビル4階',
      latitude: 35.6605913,
      longitude: 139.7019925,
    },
  ]
)
