reviews = []

# オクタゴン
reviews[1] =
  [
    {
      title: "これからも行きたい",
      content: "禁煙なのは喫煙者にとってちょっとつらいですが､店内はキレイですし、マナーの良い方が殆どで、とても楽しめました。是非次回にも足を運びたいと思っています。",
    },
    {
      title: "きれい",
      content: "きれいな雀荘です。有名なプロ雀士もよく来られています。",
    },
    {
      title: "うるさい",
      content: "打牌がうるさい云々…置き切りとかしないのである程度はと思いました！いちいちうるさいのでもう行きません",
    },
    {
      title: "プロが多い",
      content:
        "平日にはトッププロのゲストが来店
されて且つ、従業員の大半はプロであり、
お客さんも強い人が多いので、
麻雀を強くなりたい人にはとても良い場所だ",
    },
    {
      title: "楽しい！",
      content: "楽しかったよ～！ノーレートだから安心！女性は１ゲーム250円とサービス価格でお得！ありがとう。また行くね(^^)/",
    },
    {
      title: "良い",
      content: "禁煙で清潔感があるところは良い。有名プロと同卓できることもいい。",
    },
    {
      title: "皆さん真剣",
      content: "ノーレート、禁煙の雀荘。
最強位戦ルール&Mリーグルール(fリーグ)。
マナーもよく皆さん真剣に麻雀をやられています。居心地のよいところです。",
    },
    {
      title: "親切！",
      content: "みなさんすこぶるお行儀が良いです。
スタッフもお客さんも分からないことを親切に教えて下さり助かりました。",
    },
    {
      title: "初心者でも大丈夫",
      content: "ノーレートなので初心者でも早さについていければ大丈夫だと思います。
正直計算はまだ丸投げしてますが、初心者マークを使えば、そんなに文句は言われないと思います。。",
    },
    {
      title: "普通",
      content: "禁煙の雀荘。とはいえオシャレとかいうことはなく、内装や雰囲気は普通の雀荘です。",
    },
    {
      title: "とてもよい",
      content: "禁煙ノーレートでスタッフの接客・お客さんのマナーがとてもよい雀荘です。",
    },
  ]

# しぶとん
reviews[2] =
  [
    {
      title: "学生におすすめ！",
      content: "渋谷でバイトしているのですが、いつもバイト終わりに仲間と行きます！メンバーもみんないい人で、居心地もいいのですごい時で5日連続とかで行ってました！平日の学生だとかなり安いと思います！
ご飯も美味しいです",
    },
    {
      title: "セットでも入りやすい",
      content: "セットでも入りやすい。土日の夜からでも予約無しで入れることが多い。",
    },
    {
      title: "通いやすい",
      content: "ノーレート雀荘としては、特に通いやすいお店だと思います。ハウスマナーをしっかり守る必要がありますが、打ち出して慣れてしまえば、特に気にならないです。ちょっとクセのある常連さんがいる印象。",
    },
    {
      title: "カレー！！",
      content: "比較的キレイで客層も落ち着いています。
やっぱりカレーが美味しいですね",
    },
    {
      title: "賑やか",
      content: "麻雀好きなら知名度が高いのではないだろうか。
ノーレートで楽しめるので、若い人から高齢者まで幅広い客層がいる。

年に数回しぶとんカップなる大会もあり、にぎやかで楽しめる店だ。",
    },
    {
      title: "サービスよし",
      content: "ソフトドリンクは飲み放題。平日のみですがアルコールや食べ物のサービスもございます。",
    },
    {
      title: "融通が効く",
      content: "土曜日夜22時過ぎに行きました。
卓があいてなかったからか、20分程度待ちました。フリーは23時までですが、同卓者の同意があって24時まで、打てました。スタンプがそろうとくじ引きで、特典得られます。",
    },
    {
      title: "店員さんが良い",
      content: "雀荘の店員は結構ぶっきらぼうなイメージでしたが、ここの店員さんは全員丁寧です。",
    },
    {
      title: "楽しい！",
      content: "楽しいです（笑）ルールやマナーは厳しいですが、その分頭使い、老化を防げるかも？です（笑）",
    },
    {
      title: "",
      content: "雀荘デビューにはもってこいのお店です！ノーレートでプロの店員さんが優しく色々教えてくれるお店です！",
    },
  ]

# 健康麻将 ガラパゴス 渋谷本店
reviews[3] =
  [
    {
      title: "お得！！",
      content: "お得です！
食べ放題、飲み放題は素晴らしいです。
禁煙とコメントされている方がいらっしゃいましたが、バリバリみんな吸ってます。
スタッフの接客は、当たり外れがあるのでしょうか、自分はイヤな思いはしなかったです。
雀荘にしては、0時閉店はやや早めな感じでしょうか、、",
    },
    {
      title: "飲み放題",
      content: "たまに仲間とこぞっていきます。健康マージャンのはずですが、最近たばこは暗黙で吸ってます。禁煙だとなおありがたいです。食べ飲み放題で3600円なので、飲みに行くより安いです。",
    },
    {
      title: "食べ飲み放題",
      content: "食べ飲み放題で麻雀楽しめます！",
    },
    {
      title: "驚異的なコスパ！",
      content: "税込3600円で7時間、飲み放題、食い放題、打ち放題というのは驚異的なコスパだと思う。",
    },
    {
      title: "とてもよかった",
      content: "食べ飲み放題が出来てとてもよかったです！",
    },
    {
      title: "先生が優しい",
      content: "とても親切な先生方でとても助かってます！",
    },
    {
      title: "スタッフが最高！！",
      content: "店長をはじめ、スタッフの方々全員の接客がgoodです！！
皆さまレッスンプロのデュプロマを持ち、指導は理論的！！毎回楽しみです！",
    },
    {
      title: "スタッフが良い",
      content: "スタッフが丁寧で居心地がよいです。",
    },
    {
      title: "コスパ",
      content: "食べ放題飲み放題って凄い",
    },
    {
      title: "コスパ最高",
      content: "居酒屋＋麻雀=安い",
    },
    {
      title: "安い！！",
      content: "場代、飲み放題、食べ放題で￥3,600は安い！",
    },
  ]

# エンジョイマージャン エフ
reviews[4] =
  [
    {
      title: "また来たい",
      content: "とてもきれいな雀荘。またいきたいです",
    },
    {
      title: "とても綺麗！",
      content: "とっても綺麗な雀荘です。卓間もゆったりしているし禁煙。オーナーさん？の女性店員さんもとても感じよいです！イチゴジュースは生いちごを使った手作りジュースでめちゃくちゃ美味しい！おすすめです。",
    },
    {
      title: "かなり良い",
      content: "禁煙です。照明は、明るいです。麻雀卓は、新しいです。食事は、美味しい。かなり、キレイです。",
    },
    {
      title: "最高",
      content: "ご飯も美味しく環境も最高。",
    },
  ]

# 麻雀ZOO 渋谷文化村通り店
reviews[5] =
  [
    {
      title: "パラダイス！",
      content: "完全禁煙しかも飲食の持ち込み自由なパラダイス！
道の向い側にはドンキもあります。",
    },
    {
      title: "良いお店",
      content: "セットもウェルカムしてくれる良いお店。完全禁煙なので気に入っています。",
    },
    {
      title: "快適",
      content: "禁煙なのがうれしいですね。トイレの扉がちょっとがたついてるところが難点ですが、麻雀自体は快適に楽しめます。",
    },
    {
      title: "雰囲気が良い",
      content: "禁煙店で雰囲気も良く、良く利用させてもらっています。",
    },
    {
      title: "役満！！",
      content: "国士無双と四暗刻だした！",
    },
    {
      title: "禁煙は良いけど・・・",
      content: "禁煙なのはいいが、雑居ビルのエレベーターが狭く空き缶も落ちてたりして汚い。あと店内の換気が悪すぎる。",
    },
    {
      title: "きれい",
      content: "禁煙最高
牌もテーブルも喫煙よりきれい",
    },
    {
      title: "安心",
      content: "客層か若く、初心者にも安心です。禁煙だし。",
    },
    {
      title: "貴重な存在",
      content: "もう長い間禁煙で貴重な存在です。",
    },
    {
      title: "禁煙最高",
      content: "禁煙店です。

お盆では料金が割高になっていました。
1200/1h → 1600/1h",
    },
  ]

# 麻雀クエスチョン 渋谷店
reviews[6] =
  [
    {
      title: "お気に入り！",
      content: "最近のお気に入り。セットが安い、フリーはメンバーさん強いけど楽しかった！",
    },
    {
      title: "換気が・・・",
      content: "とにかく換気してなく、服がヤニがもれなく着きます。
料金は、良心的で金曜日夜はかなり混むので、予約が必要。
配牌の綺麗さはそこそこ。
空気がクリーンなら常連になりたかったところ(^_^;)",
    },
    {
      title: "次も利用したい",
      content: "スタッフさんがみんな優しかった！安かったので次も利用したい。",
    },
    {
      title: "安くて良いお店",
      content: "喫煙なので服が煙草臭くなるけど安くて良いお店です。",
    },
  ]

# 麻雀ZOO 渋谷バスケ通り店
reviews[7] =
  [
    {
      title: "元気！",
      content: "店員さんは若い方が多く、元気に働いています。",
    },
    {
      title: "雰囲気いい",
      content: "普通の雀荘。雰囲気はよいです。持ち込み可なのがよいですね。",
    },
    {
      title: "常連多め",
      content: "常連さんしかいないけど、まあ勝ちやすい",
    },
    {
      title: "喫煙可",
      content: "禁煙店のため非喫煙者には嬉しい。",
    },
  ]

# フリー麻雀さん渋谷店
reviews[8] = []

# 雀荘 すずめ荘
reviews[9] =
  [
    {
      title: "店員さんが丁寧",
      content: "店員は丁寧。卓は古め。分煙がないのでかなりタバコ臭くなる。",
    },
    {
      title: "静かにやりたい人にオススメ",
      content: "静かなのはいい。カレーも美味しい。
金曜日夜でほぼ貸しきりに近い。

ただ理由がわかりました。
全部税別、22時から深夜料金で割り増し。
飲み物は350ml缶200円販売。持ち込み不可、持ち込みの場合、1本あたり300円払いと全体的に金額はかかりました。
煙くなく静かにやりたい人にはオススメです。",
    },
    {
      title: "昔ながら",
      content: "良くも悪くも少しボロい昔ながらの雀荘。卓数は多いし、朝でも深夜でもいつでも入れる安心感。
久々の訪問は年末でした。前は中華系の料理が多かったイメージだけど、年末特別メニューのせいかメニュー構成が変わっていた。",
    },
    {
      title: "昭和の雀荘",
      content: "「昭和の雀荘」といった趣。騒がしくなく寛げる空間です。",
    },
  ]

# 麻雀ウェルカム渋谷店
reviews[10] =
  [
    {
      title: "接客が抜群！",
      content: "店員さんの接客は抜群に良い。
他の方も書かれているように常連でクセのある奴はちらほら。",
    },
    {
      title: "初心者おすすめ",
      content: "接客は気持ちよく、初めて行くには良い。
店員も元気があり、麻雀もそこそこ。

ただ常連にはクセの強い、俺強い勘違いが多いかな。",
    },
    {
      title: "安い！",
      content: "渋谷のテンゴではカメと並んでいいフリー雀荘。セットも安い",
    },
    {
      title: "丁寧な接客",
      content: "丁寧な接客。タバコの煙が籠りやすい。",
    },
    {
      title: "ココでしょ！",
      content: "渋谷で雀荘といったらココ",
    },
  ]

# 麻雀クラブ源
reviews[11] =
  [
    {
      title: "食べ物が美味しい！",
      content: "もう何年も2ヶ月に1度位利用させてもらっていますが、ママさんの人がらでアットホームな感じで大好きな雀荘です。そして、食べ物が手作りで美味しい！
焼きそば、チャーハン、カレー、ラーメンそして、おにぎりもボリュームたっぷりで美味しいですよぉ〜！！
行ったら、手作りのおつまみを小皿でいくつも出してくれるし、途中でコーヒーとかカットフルーツも数種類出してくれます！！！",
    },
    {
      title: "ママが最高！！",
      content: "ママの人柄最高♪
おつまみ&食事が美味しい
週末は予約した方が間違いなし",
    },
  ]

overall_sample = (3..5).to_a
cleanliness_sample = (3..5).to_a
service_sample = (2..5).to_a
customer_sample = (1..5).to_a

(1..11).each do |i|
  reviews[i].count.times do |j|
    Parlor.find(i).reviews.create(
      title: reviews[i][j][:title],
      content: reviews[i][j][:content],
      overall: overall_sample.sample,
      cleanliness: cleanliness_sample.sample,
      service: service_sample.sample,
      customer: customer_sample.sample,
      user_id: j + 3,
    )
  end
end
